Revit 2027 API
AdvancedLossFactor(AdvancedLossFactor) Constructor
 Creates a copy of the given advanced loss factor object
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AdvancedLossFactor(
	AdvancedLossFactor other
)
Public Sub New (
	other As AdvancedLossFactor
)
public:
AdvancedLossFactor(
	AdvancedLossFactor^ other
)
new :
        other : AdvancedLossFactor -> AdvancedLossFactor
Parameters
other AdvancedLossFactor
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
AdvancedLossFactor Class
AdvancedLossFactor Overload
Autodesk.Revit.DB.Lighting Namespace